lib/tasks/dev.rake

  task setup: :environment do
    10.times do |i|
      Jogador.create!(
        nome: Faker::Name.name,
        idade:Faker::Internet.email,
        selecao:Faker::Address.country,
      )
---
INSERT INTO "jogadors" ("nome", "idade", "selecao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Dr. Emilio D'Amore"], ["idade", 0], ["selecao", "United Arab Emirates"], ["created_at", "2023-01-30 15:06:49.497559"], ["updated_at", "2023-01-30 15:06:49.497559"]]