app/controllers/players_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."team_id" = ?  [["team_id", 2]]
---
  def players_by_team
    team_id = params[:team_id]
    team = Team.where(id: team_id)
    players = Player.where(team_id: team_id)

INSERT INTO "players" ("name", "age", "created_at", "updated_at", "team_id") VALUES (?, ?, ?, ?, ?)  [["name", "Neymar"], ["age", 30], ["created_at", "2023-01-30 18:39:44.024093"], ["updated_at", "2023-01-30 18:39:44.024093"], ["team_id", 3]]
---
  def create
    @player = Player.new(player_params)

    if @player.save