app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
INSERT INTO "teams" ("country", "created_at", "updated_at") VALUES (?, ?, ?)  [["country", "USA"], ["created_at", "2023-01-30 17:11:35.974093"], ["updated_at", "2023-01-30 17:11:35.974093"]]
INSERT INTO "matches" ("time_a_id", "time_b_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["time_a_id", 4], ["time_b_id", 2], ["created_at", "2023-01-30 19:03:28.368038"], ["updated_at", "2023-01-30 19:03:28.368038"]]
---
  def sample
    teams = Team.all.to_a
    team1, team2 = teams.sample(2)
    Match.create(time_a_id: team1.id, time_b_id: team2.id)

INSERT INTO "teams" ("country", "created_at", "updated_at") VALUES (?, ?, ?)  [["country", "Canada"], ["created_at", "2023-01-30 18:38:00.886390"], ["updated_at", "2023-01-30 18:38:00.886390"]]
---
  def create
    @team = Team.new(team_params)

    if @team.save